## 1.Create a database called temp_db. Open a cursor to this newly created database.

In [42]:
import sqlite3

In [43]:
con =sqlite3.connect('temp_db')
cursorObj = con.cursor()

## 2.In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [44]:
cursorObj.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER, ename TEXT, salary REAL, deptno INTEGER)')

## 3.In the emp table created in Q.No. 2, insert any five records.

In [45]:
cursorObj.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER, ename TEXT, salary REAL, deptno INTEGER)')

In [46]:
cursorObj.execute('INSERT INTO emp values(101,"Ramesh",900000,1)')

def insert(e,n,s,d):
    con=sqlite3.connect('temp_db')
    cursorObj = con.cursor()
    cursorObj.execute('INSERT INTO emp values(?,?,?,?)',(e,n,s,d))
    con.commit()
    con.close()

In [47]:
con.close()

In [48]:
insert (102,"Suresh",8900,20)
insert (103,"Mahesh",23000,30)
insert (104,"Kamesh",95000,10)
insert (105,"Sampoornesh",20000,40)

In [49]:
def create_table():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER, ename TEXT, salary REAL, deptno INTEGER)')
    con.commit()
    con.close()

In [50]:
create_table()

## 4.From the emp table, display all the records.

In [51]:
def view():
    conn = sqlite3.connect('temp_db')
    cur=conn.cursor()
    cur.execute('SELECT * FROM emp')
    rows = cur.fetchall()
    conn.close()
    return rows

In [52]:
view()

[(102, 'Suresh', 8900.0, 20),
 (103, 'Mahesh', 23000.0, 30),
 (104, 'Kamesh', 95000.0, 10),
 (105, 'Sampoornesh', 20000.0, 40)]

## 5.From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [53]:
def view1(s,d):
    conn =sqlite3.connect('temp_db')
    cur=conn.cursor()
    cur.execute('SELECT salary, salary FROM emp where salary > ? and deptno = ? ',(s,d))
    rows=cur.fetchall()
    conn.close()
    return rows

In [54]:
view1(15000,10)

[(95000.0, 95000.0)]

## 6.From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [55]:
conn =sqlite3.connect('temp_db')
cur=conn.cursor()
cur.execute('SELECT * FROM emp where salary between 20000 and 25000 and deptno != 10 ')
cur.fetchall()

[(103, 'Mahesh', 23000.0, 30), (105, 'Sampoornesh', 20000.0, 40)]

## 7.From the emp table, display the records of only those employees whose name begins with M.

In [56]:

conn =sqlite3.connect('temp_db')
cur=conn.cursor()
cur.execute("SELECT * FROM emp where ename like 'M%' ")
cur.fetchall()

[(103, 'Mahesh', 23000.0, 30)]

## 8.In the emp table, delete the records of those employees who belong to deptno 30

In [60]:
def delete(d):
    conn = sqlite3.connect('temp_db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp where deptno = ?',(d,))
    conn.commit()
    conn.close()

In [61]:
delete(30)

In [62]:
view()

[(102, 'Suresh', 8900.0, 20),
 (104, 'Kamesh', 95000.0, 10),
 (105, 'Sampoornesh', 20000.0, 40)]

## 9.In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [64]:
x=int(input('Enter the input:'))
str1="update emp set salary=salary*1.1 where empno = " + str(x)
conn =sqlite3.connect('temp_db')
cur=conn.cursor()
cur.execute(str1)
cur.execute('SELECT * FROM emp')
cur.fetchall()

Enter the input:104

[(102, 'Suresh', 8900.0, 20),
 (104, 'Kamesh', 104500.00000000001, 10),
 (105, 'Sampoornesh', 20000.0, 40)]

## 10.Delete the emp table.

In [65]:

cur.execute('Drop table emp')
conn.commit()
conn.close()

In [66]:
view()

OperationalError: no such table: emp